alexandreberg/STM32_BluePill_Tests/src/main.cpp
/* Blue_Pill_Lora_Transmitter_with_RFM95_BPLTwR_23.09.2021-01
 * Código do sensor que está ativo na ponte pequena
 *
 * Alexandre Nuernbegr - alexandreberg@gmail.com
 *
 * Code available on: https://github.com/alexandreberg/SAPM_Sensor_BluePill
 *
 * RFM95 LoRa Connection - STM32 Bluepill
 *    VCC - 3.3V
 *    GND - GND
 *    LoRa_SCK - LoRa_SCK (PA5)
 *    LoRa_MISO - LoRa_MISO (PA6)
 *    LoRa_MOSI - LoRa_MOSI (PA7)
 *    LoRa_NSS - (PA4)
 *    RESET - (PA0)
 *    LoRa_DIO0 - (PA1)
 *
 * BackupRegisters:
 * See https://community.st.com/t5/stm32-mcus/how-to-use-the-stm32-s-backup-registers/ta-p/49892
 *
 * Backup registers can be written/read and protected and have the option of being preserved in VBAT mode when the VDD domain is powered off.
 * The BackUp Registers are part of the RTC peripheral so we will need to enable the RTC to be able to access them.
 * The STM32 Blue Pill, which typically uses the STM32F103C8T6 microcontroller, has 10 backup registers.
 * Each register is 16 bits wide, providing a total of 20 bytes of data that can be stored in the backup domain.
 *
 * (!) To be able to preserve the backup registers through a power cycle, VBAT must remain powered when VDD is removed, this is called the VBAT mode.
 *
 * 23.11.2024 - Changing the code to read and hibernate for 1 minute between ultrasound readings.
 *             - 1min on and 1min off, adjust to not stay on for so long and turn off as soon as it transmits
 * 24.11.2024 - changing the readUltrasonic() function to work with the median
 *
 * 24.12.2024 - Cleaning and organizing the file
 *
 * TODO:
 * reactivate hibernation and make it sleep for 1min
 *
 *
BackupRegister Values:
Register - Value - Description
BR0 - último estado (logState)
BR1  →
BR2  → != 0 - indicates that  STM32 should to go into deepsleep
BR3  → != 0 -//indicates that  have to go into deepsleep
BR4  → contador de boots
BR5 e BR6 → timestamp (parte baixa/alta)
BR7 - FREE
BR8 - FREE
BR9 - FREE

Flag to enter in deep sleep mode:
goToSleep_flag = 0; i boot flag
goToSleep_flag = 1; //hibernation flag normal deepsleep ?????
goToSleep_flag = 2; //hibernation flag 1min ?????

Last state before reset/sleep:
goToSleep = 10 // vai dormir
loop = 20 // entrou no loop
onReceive = 30
sendReadings = 40

-06.08.2025 OK  - Cleaning and organizing the file
            OK  - Identing the file
            OK - Increasing RSSI signal for LoRa power to 20dBm
            - Correcting problem that sends lora message before ending US routines.
-27.08.2025 - Trying to correct the problem that freezes the return of the sensor after the hibernation leaving the holes in the graphic.
 * Debug-enhanced version of BluePill LoRa Transmitter
 * - Logs last execution state into BackupRegisters
 * - Handles new LoRa timestamp message format: "TS:<timestamp>"
 * - Prints backup registers at startup
 * 
BR1 / BR2 → timestamp (parte baixa/alta)

Sobre a lib low power:
https://github.com/stm32duino/STM32LowPower
void shutdown(uint32_t ms): enter in shutdown mode param ms (optional): number of milliseconds before to exit the mode. The RTC is used in alarm mode to wakeup the board in ms milliseconds.
Important:
RTC used as Wakeup source requires to have LSE or LSI as clock source. If one of them is used nothing is changed else it will configure it to use LSI clock source. One exception exists when SHUTDOWN_MODE is requested and PWR_CR1_LPMS is defined, in that case LSE is required. So, if the board does not have LSE, it will fail.
Eu uso o: rtc.setClockSource(STM32RTC::LSE_CLOCK); está correto.
The board will restart when exit shutdown mode.

Hardware state
shutdown mode: high wake-up latency (possible hundereds of ms or second timeframe), voltage supplies are cut except always-on domain, memory content are lost and system basically reboots.



*/

/*********************************************** Sensor Description ***********************************************/
#define sensor_id "Station_02"      // <<=== Sensor identification  ==>> CHANGE HERE!!
#define sensor_location "Bridge_01" // <<=== Sensor location        ==>> CHANGE HERE!!

/*********************************************** Macro Definitions ***********************************************/
// Enable (uncommenting) or disable (commenting out) services and periferals
#define enableSerialLog  // enable Serial debug on console
#define enableWatchDog   // enable watchdog for deepsleep
#define enableUltrasonic // enable Ultrasonic Sensor
#define enableRTCstm32   // using STM32 internal RTC Clock
// #define enableTinyRTC         // TODO: not used because de SPI bus freezes and loose the connection!
#define enableLoRa // enable LoRa communication
#define enableDebug // Enable verbosity in debugging log

/*********************************************** Library Definitions ***********************************************/
#include <Arduino.h>
#include <stdlib.h>
#include <STM32LowPower.h> //Deep Sleep for STM32
#include <SPI.h>
#include <time.h>

#ifdef enableRTCstm32
#include <STM32RTC.h>
#endif

#ifdef enableWatchDog
#include <IWatchdog.h>
#endif

#ifdef enableTinyRTC
#include "RTClib.h" //Date and time functions using a DS1307 RTC connected via I2C and Wire lib (Not used because it is loosing connection with the SPI BUS)
#endif

#ifdef enableUltrasonic
#include <NewPing.h>
#endif

#ifdef enableLoRa
#include <LoRa.h>
#endif

/*********************************************** Global Variables ***********************************************/
String version = "System Version: SAPM_Sensor_BluePill_2025091402 New PCB Pins"; // ==> CHANGE HERE! <==

#ifdef enableWatchDog
const int ledPin = PC13; // TODO: Just to have visual information that it is working.
#endif

#ifdef enableTinyRTC // Not used
// Store date and time
int year = 0;
int month = 0;
int day = 0;
int hours = 0;
int minutes = 0;
int seconds = 0;
float timezone = 0;
String DATE_FULL3;

RTC_DS1307 rtc;

char daysOfTheWeek[7][12] = {"Sunday", "Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday"};
#endif // enableTinyRTC

