alexandreberg/STM32_BluePill_Tests/src/main.cpp
#ifdef enableRTCstm32 // Working
boolean onReceive_flag = 0;
/* Get the rtc object */
STM32RTC &rtc = STM32RTC::getInstance();
byte startUpMinute = 0;
/* Change these values to set the current initial time */
byte seconds = 0;
byte minutes = 0;
byte hours = 0;

/* Change these values to set the current initial date */
byte weekDay = 0;
byte day = 0;
byte month = 0;
byte year = 0;

#endif // enableRTCstm32

#ifdef enableUltrasonic
const unsigned int triggerPin = PA3;
const unsigned int echoPin = PA2;
// long lastEchoDistance = 0;             // We want to keep these values after reset
unsigned long pulseLength = 0;
unsigned long readingDistance = 0; // Measured distance in centimeters
// unsigned long maxReadingNumber = 0;    // Number of ultrasonic readings to do the calculation of mean and average
bool distance_reading_done = false;
#endif // enableUltrasonic

int goToSleep_flag = 0; // Flag to enter in deep sleep mode

#ifdef enableLoRa
                        // define the pins used by the LoRa transceiver module
#define LoRa_SCK PA5
#define LoRa_MISO PA6
#define LoRa_MOSI PA7
#define LoRa_NSS PA4 // LoRa radio chip select
// #define LoRa_RST = PA8; // LoRa radio reset ==> New PCB
// #define LoRa_DIO0 = PA15; // Change for your board; must be a hardware interrupt pin of the STM32 Bluepill ==> New PCB
// #define LoRa_RST PA0 // LoRa radio reset ==> Old PCB in this works
// #define LoRa_DIO0 PA1 // Change for your board; must be a hardware interrupt pin of the STM32 Bluepill ==> Old PCB in this works
#define LoRa_RST PB1  // it worked on breadboard
#define LoRa_DIO0 PB0 // it worked on breadboard



// Define LoRa Communication Band:
#define BAND 915E6 /*  915E6 for Brazil (902-928 MHz) \
                       433E6 for Asia                 \
                       866E6 for Europe               \
                       915E6 for North America */

int lora_startup_counter = 0; // Counter to check if LoRa chip started communication propperly
long readingID = 0;           // Sending packet N°

String LoRaMessage = ""; // String to store the LoRa Message that should be sent
#endif                   // enableLoRa

/*********************************************** Function Prototypes ***********************************************/
void sketchSetup();
void readUltrasonic();
float calculateMedian(int *array, int arraySize);
int compareReadings(const void *a, const void *b);
void logState(uint16_t code);

#ifdef enableTinyRTC
// void startTinyRTC();
// void setTime();
// void readTimeTinyRTC();
#endif // enableTinyRTC

#ifdef enableRTCstm32
void setupRTC();
void setTime();
void readTime();
#endif // enableRTCstm32

#ifdef enableUltrasonic
void ultrasonic_setup();
void readUltrasonic();
float calculateMedian(int *array, int arraySize);
int compareReadings(const void *a, const void *b);
#endif // enableUltrasonic

#ifdef enableLoRa
void LoRa_rxMode();
void LoRa_txMode();
void onReceive(int packetSize);
void LoRa_sendMessage(String message);
void onTxDone();
boolean runEvery(unsigned long interval);
void checkonReceive();
boolean runClockEvery(unsigned long interval);
void start_LoRa();
void sendReadings();
#endif // enableLoRa

void goToSleep();

/*********************************************** End Function Prototypes *******************************************/
// TODO: Need to be better documented and clarified!!!!
void setup()
{
  // distance_reading_done = true; // emulates us sensor readng
  sketchSetup();         // Setup of the Serial log and initial serial setup
  pinMode(PC13, OUTPUT); // Initialize digital pin PC13 (LED) as an output.

  // Blink pattern at startup
  for (int i = 0; i < 5; i++)
  {
    digitalWrite(PC13, HIGH);
    delay(150);
    digitalWrite(PC13, LOW);
    delay(150);
  }

  // Contador de reinicializações no BackupRegister 4
  /* Cada vez que o setup() roda (seja por reset, watchdog ou wake-up), ele incrementa o valor armazenado no BR4.*/
  enableBackupDomain();
  uint16_t bootCounter = getBackupRegister(4);
  bootCounter++;
  setBackupRegister(4, bootCounter);
  disableBackupDomain();

  Serial.print("Boot counter (BR4): ");
  Serial.println(bootCounter);

#ifdef enableWatchDog
  enableBackupDomain(); // Function of .platformio\packages\framework-arduinoststm32\cores\arduino\stm32\backup.h

  if (getBackupRegister(2) != 0)
  { // indicates that  STM32 should to go into deepsleep
    Serial.println("Sistema reinicializado pelo WatchDog ... === Irá entrar em hibernação ... === BR2 = " + String(getBackupRegister(2)));
    setBackupRegister(2, 0);
    delay(100);
    setupRTC();
    LowPower.begin();
    goToSleep_flag = 2; // hibernation flag 1min
    goToSleep();
  }

  // if (getBackupRegister(3) != 0)
  // { // indicates that  have to go into deepsleep
  //   Serial.println("Sistema reinicializado pelo WatchDog preparando para hibernação...=== BR3 = " + String(getBackupRegister(3)));
  //   setupRTC();
  //   enableBackupDomain();
  //   setBackupRegister(3, 0);
  //   delay(100);
  //   LowPower.begin();
  //   goToSleep_flag = 1; // hibernation flag normal deepsleep ?????
  //   goToSleep();
  // }
  disableBackupDomain();
  IWatchdog.begin(10000000); // Init the watchdog timer with 10 seconds timeout
#endif

  // Enable the LoRa power supply
  // TODO: Disabled to test instability
  // pinMode(PB13, OUTPUT);
  // digitalWrite(PB13, HIGH);

  // delay(50); // Enable MP2307 in the MINI360 power regulator, it is needed 16ms to activate Vout

  Serial.println("Starting RTC with LSE Clock...");
  setupRTC();
  delay(50);
  // Serial.println("setTime()");
  //   setTime();
  //   startUpMinute = rtc.getMinutes();
  // if (!rtc.isConfigured())
  // {
  //   Serial.println("Erro: RTC com LSE não está funcionando!");
  //   // Colocar alguma lógica alternativa ou travar o sistema
  //   while (1)
  //     ;
  // }
  Serial.println("LowPower.begin()");
  LowPower.begin();
  goToSleep();

  // Serial.println("ultrasonic_setup()");
  ultrasonic_setup();
  Serial.println("start_LoRa()");
  start_LoRa();
}

/*********************************************** loop () ***********************************************/
void loop()
{
  logState(20); // entrou no loop
  readUltrasonic();
  sendReadings();

#ifdef enableWatchDog
  IWatchdog.reload();
#endif

