alexandreberg/STM32_BluePill_Tests/src/main.cpp
  // if (runClockEvery(1000 * 10))
  // {                     // Does it say here how long it stays active?? 10s
  // goToSleep_flag = 2; // Flag that indicates that have to hibernate FOR 1MIN

  enableBackupDomain();
  setBackupRegister(2, 10);
  disableBackupDomain();
  delay(5000); // Espera 5 segundos entre transmissões

  // }
  goToSleep();
  // checkonReceive(); //TODO desativo pq não tem como diferenciar qdo volta do boot pelo watchdog precisaria ter um flag gravado em memo rtc
  //  delay(60000); //faz uma leitura por minuto
}

/*********************************************** End loop () ***********************************************/

/*********************************************** Function Definitions ***********************************************/
//////////////////////////////////////////////////// sketchSetup ////////////////////////////////////////////////////
// Shows system infomation and configures serial interface
void sketchSetup()
{
  Serial.begin(115200);
  delay(200);

  Serial.println("\nStarting Sensor: " + String(sensor_id) + " on " + String(sensor_location));
  Serial.println("\nIlha 3d");
  Serial.println("\nwww.ilha3d.com");
  Serial.println("\n");
  Serial.println(String(version));
  Serial.println("");

  Serial.println("=== Boot STM32 Sensor Node with New PCB Pins===");
  Serial.print("Last state before reset/sleep: ");
  Serial.println(getBackupRegister(0));
  Serial.print("BackupReg1 (TS low): ");
  Serial.println(getBackupRegister(5));
  Serial.print("BackupReg2 (TS high): ");
  Serial.println(getBackupRegister(6));

#ifdef enableDebug
  Serial.println("Last values of all Backup Registers:");
  Serial.println("BR0 = " + String(getBackupRegister(0)));
  Serial.println("BR1 = " + String(getBackupRegister(1)));
  Serial.println("BR2 = " + String(getBackupRegister(2)));
  Serial.println("BR3 = " + String(getBackupRegister(3)));
  Serial.println("BR4 = " + String(getBackupRegister(4)));
  Serial.println("BR5 = " + String(getBackupRegister(5)));
  Serial.println("BR6 = " + String(getBackupRegister(6)));
  Serial.println("BR7 = " + String(getBackupRegister(7)));
  Serial.println("BR8 = " + String(getBackupRegister(8)));
  Serial.println("BR9 = " + String(getBackupRegister(9)));
#endif
}

#ifdef enableTinyRTC
void startTinyRTC()
{
  while (!Serial)
    ; // wait for serial port to connect. Needed for native USB

  if (!rtc.begin())
  {
    Serial.println("Couldn't find RTC");
    Serial.flush();
    // abort();
  }

  if (!rtc.isrunning())
  {
    Serial.println("RTC is NOT running, let's set the time!");
    // When time needs to be set on a new device, or after a power loss, the
    // following line sets the RTC to the date & time this sketch was compiled
    ////rtc.adjust(DateTime(F(__DATE__), F(__TIME__)));
    // This line sets the RTC with an explicit date & time, for example to set
    // January 21, 2014 at 3am you would call:
    // rtc.adjust(DateTime(2014, 1, 21, 3, 0, 0));
  }

  // When time needs to be re-set on a previously configured device, the
  // following line sets the RTC to the date & time this sketch was compiled
  // rtc.adjust(DateTime(F(__DATE__), F(__TIME__)));
  // This line sets the RTC with an explicit date & time, for example to set
  // January 21, 2014 at 3am you would call:
  // rtc.adjust(DateTime(2014, 1, 21, 3, 0, 0));
}

void setTime()
{
  // Set the time
  // rtc.adjust(DateTime(2014, 1, 21, 3, 0, 0));
  rtc.adjust(DateTime(year - 2000, month, day, hours, minutes, seconds));
}
void readTimeTinyRTC()
{
  DateTime now = rtc.now();
  char DATE_FULL_RTC[] = "DD/MM/YYYY, hh:mm:ss";
  /*
  Serial.print(now.year(), DEC);
  Serial.print('/');
  Serial.print(now.month(), DEC);
  Serial.print('/');
  Serial.print(now.day(), DEC);
  Serial.print(" (");
  Serial.print(daysOfTheWeek[now.dayOfTheWeek()]);
  Serial.print(") ");
  Serial.print(now.hour(), DEC);
  Serial.print(':');
  Serial.print(now.minute(), DEC);
  Serial.print(':');
  Serial.print(now.second(), DEC);
  Serial.println();
  */
  Serial.print("Data e hora atual: ");
  Serial.println(now.toString(DATE_FULL_RTC));
  // Prepara para atualizar o grafico a cada 30minutos
  /*if (now.minute() == 30 or now.minute() == 0) {
    //Serial.println(rtc.getHours());
    //Serial.println(rtc.getMinutes());
    Serial.println("Time of Transmission to Server");
  }*/
}
#endif // enableTinyRTC

#ifdef enableRTCstm32
void setupRTC()
{
  // Select RTC clock source: LSI_CLOCK, LSE_CLOCK or HSE_CLOCK.
  // By default the LSI is selected as source.
  // rtc.setClockSource(STM32RTC::LSI_CLOCK); //3V3 ligado com diodo no VBAT
  rtc.setClockSource(STM32RTC::LSE_CLOCK); // 3V3 wired with a diode on VBAT
  rtc.begin();                             // initialize RTC 24H format
}

void setTime()
{
  // Set the time
  rtc.setHours(hours);
  rtc.setMinutes(minutes);
  rtc.setSeconds(seconds);

  // Set the date
  rtc.setWeekDay(weekDay);
  rtc.setDay(day);
  rtc.setMonth(month);
  rtc.setYear(year);
}

void readTime()
{
  // Print date...
  Serial.println("Data e hora armazenada no RTC Local");
  Serial.printf("%02d/%02d/%02d ", rtc.getDay(), rtc.getMonth(), rtc.getYear());

  // ...and time
  Serial.printf("%02d:%02d:%02d.%03d\n", rtc.getHours(), rtc.getMinutes(), rtc.getSeconds(), rtc.getSubSeconds());
}
#endif // enableRTCstm32

#ifdef enableUltrasonic
// Ultrasonic Distance Sensor setup
void ultrasonic_setup()
{
  pinMode(triggerPin, OUTPUT);
  pinMode(echoPin, INPUT);
#ifdef enableSerialLog
  Serial.println("Setting up Ultrasonic Sensor.");
#endif
} // end ultrasonic_setup

// Function adapted to calculate the median of 11 readings from the ultrasonic sensor and display it as the read distance
void readUltrasonic()
{
  int readings[11]; // 11 readings (To calculate the median it is better to use an odd number)
  int ultrasonic_readings_array_size = sizeof(readings) / sizeof(readings[0]);

#ifdef enableSerialLog
  Serial.println("ultrasonic_readings_array_size = " + String(ultrasonic_readings_array_size));
#endif

