alexandreberg/STM32_BluePill_Tests/src/main.cpp
  // Take 11 consecutive readings to calculate the median and eliminate undue readings and outliers due to ultrasound reflection:
  for (int i = 0; i < ultrasonic_readings_array_size; i++)
  {               // for1
  check_distance: // Label for goto
    digitalWrite(triggerPin, LOW);
    delayMicroseconds(5);
    digitalWrite(triggerPin, HIGH);
    delayMicroseconds(10);
    pulseLength = pulseIn(echoPin, HIGH);
    readingDistance = pulseLength / 58; // Measured distance in centimeters
    delay(50);

    if (readingDistance > 500 || readingDistance < 0)
    { // eliminate erroneous readings above or below the sensor range
      goto check_distance;
    }
    readings[i] = readingDistance;

#ifdef enableSerialLog
    Serial.println("readings-" + String(i) + " = " + String(readings[i]));
#endif
  } // for1

  float median = calculateMedian(readings, ultrasonic_readings_array_size); // Calculate the Median

  // TODO: Verifica se a median mudou significativamente
  // if (abs(median - lastEchoDistance) >= 1) { // check for change in distance só manda msg se mudar o valor > 1cm
  // lastEchoDistance = median;

#ifdef enableSerialLog
  Serial.println("Distância lida pelo sensor ultrassônico (mediana): " + String(median) + "cm");
  distance_reading_done = true;
  // Serial.println("distance_reading_done: " + String(distance_reading_done));
#endif
  // }

  delay(50); // para economizar bateria, pode-se reduzir esse tempo
}

// TODO: improve commenting
float calculateMedian(int *array, int arraySize)
{
  qsort(array, arraySize, sizeof(int), compareReadings);

// Print the sorted values
#ifdef enableSerialLog
  Serial.println("Leituras das distâncias ordenadas:");
  for (int i = 0; i < arraySize; i++)
  {
    Serial.println(array[i]);
  }
  Serial.println("\n");
#endif

  if (arraySize % 2 == 0)
  {
    return (float)(array[arraySize / 2 - 1] + array[arraySize / 2]) / 2;
  }
  else
  {
    return (float)array[arraySize / 2];
  }
}

int compareReadings(const void *a, const void *b)
{
  return (*(int *)a - *(int *)b);
}
#endif // enableUltrasonic

//////////////////////////////////////////////////// goToSleep() ////////////////////////////////////////////////////
void goToSleep()
{
  Serial.println("goToSleep()");
  logState(10); // vai dormir
  if (goToSleep_flag == 2)
  { // hibernará por 1 minuto
#ifdef enableWatchDog
    IWatchdog.reload();
#endif
    Serial.println("Hibernando por 1 minuto... goToSleep_flag == " + String(goToSleep_flag));
    delay(10);
    LowPower.shutdown(1000 * 60); // hiberna por 1 min
  }
  // Entra em Deep Sleep e acorda em horas cheias hh:00 ou hh:30
  if (goToSleep_flag == 1)
  {
    //   //DateTime now = rtc.now();
    //   //int sleepTime = 59 - now.minute(); //TinyRTC
#ifdef enableWatchDog
    IWatchdog.reload();
#endif
    Serial.println("Hibernando por 1 minuto... goToSleep_flag == " + String(goToSleep_flag));
    delay(10);
    LowPower.shutdown(1000 * 60); // hiberna por 1 min
  }
}

#ifdef enableLoRa
void LoRa_rxMode()
{
  LoRa.enableInvertIQ(); // active invert I and Q signals
  LoRa.receive();        // set receive mode
}

void LoRa_txMode()
{
  LoRa.idle();            // set standby mode
  LoRa.disableInvertIQ(); // normal mode
}

//==================================== Lora Callback void onReceive ===================================================
void onReceive(int packetSize)
{
  if (packetSize == 0) return;

  String LoRaData = LoRa.readString();
  Serial.print("LoRaData recebida: ");
  Serial.println(LoRaData);

  if (LoRaData.startsWith("TS:"))
  {
    String tsStr = LoRaData.substring(3, LoRaData.indexOf('|') > 0 ? LoRaData.indexOf('|') : LoRaData.length());
    unsigned long ts = tsStr.toInt();
    Serial.print("Timestamp recebido: ");
    Serial.println(ts);

    // ===== Conversão do timestamp para hora normal =====
    time_t rawtime = (time_t)ts;
    struct tm *timeinfo = gmtime(&rawtime); // ou localtime() se quiser considerar fuso

    char buffer[30];
    sprintf(buffer, "%02d/%02d/%04d %02d:%02d:%02d",
            timeinfo->tm_mday,
            timeinfo->tm_mon + 1,
            timeinfo->tm_year + 1900,
            timeinfo->tm_hour,
            timeinfo->tm_min,
            timeinfo->tm_sec);

    Serial.print("Hora convertida: ");
    Serial.println(buffer);
    // ================================================

    logState(30); //onReceive
    enableBackupDomain();
    setBackupRegister(5, (uint16_t)(ts & 0xFFFF));
    setBackupRegister(6, (uint16_t)((ts >> 16) & 0xFFFF));
    disableBackupDomain();
  }
  else
  {
    Serial.println("Mensagem LoRa recebida em formato inesperado.");
  }
}


void LoRa_sendMessage(String message)
{
  LoRa_txMode();        // set tx mode
  LoRa.beginPacket();   // start packet
  LoRa.print(message);  // add payload
  LoRa.endPacket(true); // garante envio completo antes de continuar
  Serial.println("Transmissão concluída. Indo dormir...");
  goToSleep_flag = 2;    // força entrada no sono
}

void onTxDone()
{
#ifdef enableSerialLog
  Serial.println("TxDone - Transmissão completa.");
#endif

  // Define a flag para hibernar. Isso só será executado quando a transmissão for finalizada.
  goToSleep_flag = 2;

  // Retorna ao modo de recepção para o próximo ciclo
  LoRa_rxMode();
}

boolean runEvery(unsigned long interval)
{
  static unsigned long previousMillis = 0;
  unsigned long currentMillis = millis();
  if (currentMillis - previousMillis >= interval)
  {
    previousMillis = currentMillis;
    return true;
  }
  return false;
}

void checkonReceive()
{ // TODO ver se essa é a função que recebe o retorno do gateway
  if (onReceive_flag == 0)
  {
    int time = (rtc.getMinutes() - startUpMinute);
    Serial.print("time:   ");
    Serial.println(time);
    if (rtc.getMinutes() - startUpMinute >= 2)
    {
      // #ifdef enableSerialLog
      Serial.print("Did not receive the Date from the Gateway! Going to sleep for 30 seconds");
      delay(100);
      // #endif
      // vai dormir por 30 segundos...
      //  LowPower.shutdown(1000 * 30); //D.S por 1000ms* 30s * sleepTime/
    }
  }
}

boolean runClockEvery(unsigned long interval)
{
  static unsigned long previousMillis = 0;
  unsigned long currentMillis = millis();
  if (currentMillis - previousMillis >= interval)
  {
    previousMillis = currentMillis;
    return true;
  }
  return false;
}

