alexandreberg/STM32_BluePill_Tests/src/main.cpp
//=============================================================================================================
// Initialize LoRa module
void start_LoRa()
{
  LoRa.setTxPower(20); // Change LoRa transmission power to 20dBm
  Serial.println("Potência de Transmissão LoRa: 20dBm");

  LoRa.setPins(LoRa_NSS, LoRa_RST, LoRa_DIO0); // SPI LoRa pins
  // LoRa.setPins(Lora_SS, Lora_RST, Lora_DIO0); //pinos definidos diretamente na lib
  // SPI.begin(LoRa_SCK, LoRa_MISO, LoRa_MOSI, LoRa_NSS); //pinos definidos diretamente na lib

  while (!LoRa.begin(BAND) && lora_startup_counter < 10)
  {
    Serial.print(".");
    lora_startup_counter++;
    delay(500);
  }
  if (lora_startup_counter == 10)
  {
    Serial.println("LoRa initialization Failed!");
    // delay (100);
  }
  if (lora_startup_counter < 10)
  {
#ifdef enableSerialLog
    Serial.println("LoRa initialization OK!");
#endif
  }

// Setup receiver para receber o update da hora:
#ifdef enableSerialLog
  Serial.println("LoRa Receiver Callback with LoRa Reset in PA0");
  Serial.println("LoRa Simple Node");
  Serial.println("Only receive messages from gateways");
  Serial.println("Tx: invertIQ disable");
  Serial.println("Rx: invertIQ enable");
  Serial.println();
#endif

  /* Endurecer a recepção: CRC + Sync Word + parâmetros idênticos
  Com CRC desativado e sync word default, qualquer ruído “LoRa-like” pode passar. Ative CRC e defina Sync Word e parametrização idêntica nos dois lados (sensor e gateway). 
  Acrescente no setup do LoRa em ambos:
  */
  LoRa.setSpreadingFactor(7);          /* igual nos dois
                                        Spreading Factor: Change the spreading factor of the radio.
                                        LoRa.setSpreadingFactor(spreadingFactor);
                                        spreadingFactor - spreading factor, defaults to 7
                                        Supported values are between 6 and 12. If a spreading factor of 6 is set, implicit header mode must be used to transmit and receive packets.*/
  LoRa.setSignalBandwidth(125E3);      /* igual nos dois
                                        Signal Bandwidth:  Change the signal bandwidth of the radio.
                                        LoRa.setSignalBandwidth(signalBandwidth);
                                        signalBandwidth - signal bandwidth in Hz, defaults to 125E3.
                                        Supported values are 7.8E3, 10.4E3, 15.6E3, 20.8E3, 31.25E3, 41.7E3, 62.5E3, 125E3, 250E3, and 500E3.*/
  LoRa.setCodingRate4(5);              /* CR 4/5 (igual nos dois)
                                        Coding Rate: Change the coding rate of the radio.
                                        LoRa.setCodingRate4(codingRateDenominator);
                                        codingRateDenominator - denominator of the coding rate, defaults to 5
                                        Supported values are between 5 and 8, these correspond to coding rates of 4/5 and 4/8. The coding rate numerator is fixed at 4.*/
  LoRa.setPreambleLength(8);           /* igual nos dois
                                      Preamble Length: Change the preamble length of the radio.
                                      LoRa.setPreambleLength(preambleLength);
                                      preambleLength - preamble length in symbols, defaults to 8
                                      Supported values are between 6 and 65535.*/
  LoRa.setSyncWord(0x12);              /* igual nos dois (privado) — escolha um e padronize
                                      Sync Word: Change the sync word of the radio.
                                      LoRa.setSyncWord(syncWord);
                                      syncWord - byte value to use as the sync word, defaults to 0x12 */
  LoRa.enableCrc();                   /* ATIVAR CRC (nos dois)
                                      Enable or disable CRC usage, by default a CRC is not used.
                                      LoRa.enableCrc();
                                      LoRa.disableCrc();*/
                                      
  // register the receive callback
  LoRa.onReceive(onReceive);
  LoRa.onTxDone(onTxDone);
  LoRa_rxMode();
} // end start_LoRa

void sendReadings()
{

  Serial.println("sendReadings()");
  logState(40); // está no sendReadings
                  // if (runEvery(5000))
                  // { // repeat every 5 sec
  // TODO se recebe confirmação de recebimento do gateway, não pode enviar mais para economizar bateria ver email: Checagem de Retorno de mensagem LoRa
  if (distance_reading_done) // Just sends after the US have done all the measurementes
  {

    // TODO: Do I know it the receiver received the LoRa message? how?
    LoRaMessage = String(sensor_id) + "/" + String(readingDistance) + "&" + String(readingDistance);

    // Send LoRa packet to receiver
    LoRa_sendMessage(LoRaMessage); // send a LoRaMessage
    distance_reading_done = false;

#ifdef enableSerialLog
    Serial.print("Sending packet N°: ");
    Serial.println(readingID);
    Serial.print("LoRaMessage: ");
    Serial.println(LoRaMessage);
#endif
#ifdef enableWatchDog
    IWatchdog.reload();
#endif

    readingID++;
  }
  // }
}

#endif // enableLoRa

/*********************************************** Helpers ***********************************************/
void logState(uint16_t code)
{
  enableBackupDomain();
  setBackupRegister(0, code);
  disableBackupDomain();
}

/*********************************************** End Function Definitions ********************************************/